package ru.levelp;

/**
 * Created by Юлия on 26.04.2016.
 */
public class Main {
    public static void main(String[] args) {
        CalculatorUI frame = new CalculatorUI();
        frame.setVisible(true);
    }

    //Calculator
              /*
+    1) Оставшиеся арифметические операции
+    2) Накапливание результата
+    3) Поле не бывает пустым (либо число, либо 0) и остальные мелочи по
+        выводу числа
+    4) Кнопки C (clear), <- (backspace), ^ (степень)
+    5) Кнопки , и -/+
+
+    Примечания:
+    - внимательно с вводом дробных чисел (только одна запятая может быть)
+    - проверяйте каждую кнопку на возникновение ошибок (например backspace,
+        когда нет цифр больше)
+     */
}


